In [ ]:
#1. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [5]:
import pandas as pd
import numpy as np

In [4]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, 'np.nan', 9, 20, 14.5, 'np.nan', 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [6]:
labels = ['a', 'b', 'c', 'd', 'e','f','g','h','i','j']

In [7]:
df = pd.DataFrame(exam_data, index = labels)

In [8]:
df

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James  np.nan         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes

In [15]:
#2. Write a program to select the rows where the number of attemps in the examination is = 1 and score is greater than 15
# use a syntax that can take boolean type input in its indexing - loc (selecting) and iloc (selecting)
df.loc[[True,False,True,True,False,False,False,False,False,False] and [False,False,True,True,False,False,False,False,False,False]]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
d      James    NaN         3      no

In [16]:
#2. Write a program to select the rows where the number of attemps in the examination is = 1 and score is greater than 15
#df['score'] = pd.to_numeric(df['score'], errors='coerce') #covert all values to numeric, or emit non-numerical values, and if there is non-numerical The errors parameter controls how pandas handles values that can't be converted to a number. Setting it to 'coerce' tells pandas to replace any non-numeric values (e.g., strings that don't represent numbers) with NaN (Not a Number), which is a special floating-point value used to represent missing data.
df.loc[(df['attempts'] == 1) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [30]:
#Change the row 'd' score to 11.5
df.loc['d','score'] = 12.5

In [31]:
df

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d       11.5   12.5      11.5    11.5
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes

In [33]:
#Change the raw 'h' score to 2.5
df.loc['h', 'score'] = 2.5

In [34]:
df

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d       11.5   12.5      11.5    11.5
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    2.5       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes

In [37]:
#Get me all the rows that are not Anatasia / Laura
df.loc[~df['name'].isin(['Anastasia','Laura'])]

        name  score  attempts qualify
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d       11.5   12.5      11.5    11.5
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes

In [38]:
df.query('name!= "Anastasia" and name!= "Laura"')

        name  score  attempts qualify
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d       11.5   12.5      11.5    11.5
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes

In [39]:
df.query('name!= "Dima" and name!= "James"')

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
c  Katherine   16.5       2.0     yes
d       11.5   12.5      11.5    11.5
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    2.5       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes

# Intermediate Python Concepts
## Recurrsion : A Function calls itself

## Factorial of a number
- 3! = 3*2*1
- 4! = 4*3*2*1
- 10! = 10*9*8*7*....1

- Used in Counting Theory Think of the example we saw in class - Selecting 5 board members from 200 people
- n!/(n-r)! r -> 5 (number of places)

- EDGE cases! -  0< n < 10000 !!!!!
- 0! = 1

In [ ]:
#Write this without recurssion

In [2]:
def factorial(num):
    fact = 1
    if (num == 1) or (num == 0):
        return 1
    else:
        for i in range(num, 1, -1):
            fact = fact*i
    return fact

In [44]:
factorial(5)

120

In [47]:
factorial(2)

2

In [5]:
factorial(68)

2480035542436830599600990418569171581047399201355367672371710738018221445712183296000000000000000

Or can use recurssion intead of factorial
# Recurssion : Last come first out

In [ ]:
#Recurssion is a type of a func that calls itself
def fact_recurssion(n):
  if (n==1)or(n==0):
    return 1
  else:
    return n*fact_recurssion(n-1)
n = int(input("Enter a number:"))
print(fact_recurssion(n))

6

6-> fact_recurssion(6)-> 6*fact_recurssion(5) -> 6*5*fact_recurssion(4) ->...-> 6*5*4*3*2*1
#Recurssion memovery overflow

### Please do the Rangoli pattern problem - Normally
### Try using Recurssion Sub-String Search - Recurssion

In [13]:
#Rangoli Pattern
def print_rangoli(size):
    if size == 1:
        print('a')
        return 0
    elif size ==0:
        return 0
    else:
        alpha = 'abcdefghijklmnopqrstuvwxyz'
        subarray_ = alpha[:size]
        center_l = "-".join(list(subarray_[::-1]))
        center_r = "-".join(list(subarray_[1:]))
        total_length = len(center_l+'-'+center_r)
        subarray_ = alpha[:size]
        for i in range(0,size-1):
            top_l = "-".join(list(subarray_[size-1-i:size][::-1]))
            top_r = "-".join(list(subarray_[size-1-i:size][1:]))
            #print(top_l+'-'+top_r)
            if top_r=="":
                print(top_l.center(total_length,'-'))
            else:
                print((str(top_l)+'-'+str(top_r)).center(total_length,'-'))
        print(center_l+'-'+center_r)
        lower_l = center_l[:-2]
        lower_r = center_r[2:]
        for i in range(size-1,0,-1):
            if lower_r == "":
                print(lower_l.center(total_length,'-'))
            else:
                print(str(lower_l+'-'+lower_r).center(total_length,'-'))
            lower_l = lower_l[:-2]
            lower_r = lower_r[2:]

In [12]:
alpha = 'abcdefghijklmnopqrstuvwxyz'


size = 6
subarray_ = alpha[:size]

center_l = "-".join(list(subarray_[::-1]))
center_r = "-".join(list(subarray_[1:]))
total_length = len(center_l+'-'+center_r)


#subarray_ = alpha[:size]
for i in range(0,size-1):
  top_l = "-".join(list(subarray_[size-1-i:size][::-1]))
  top_r = "-".join(list(subarray_[size-1-i:size][1:]))
  #print(top_l+'-'+top_r)
  if top_r=="":
    print(top_l.center(total_length,'-'))
  else:
    print((str(top_l)+'-'+str(top_r)).center(total_length,'-'))

print(center_l+'-'+center_r)

lower_l = center_l[:-2]
lower_r = center_r[2:]

for i in range(size-1,0,-1):
  if lower_r == "":
    print(lower_l.center(total_length,'-'))
  else:
    print(str(lower_l+'-'+lower_r).center(total_length,'-'))
  lower_l = lower_l[:-2]
  lower_r = lower_r[2:]

----------f----------
--------f-e-f--------
------f-e-d-e-f------
----f-e-d-c-d-e-f----
--f-e-d-c-b-c-d-e-f--
f-e-d-c-b-a-b-c-d-e-f
--f-e-d-c-b-c-d-e-f--
----f-e-d-c-d-e-f----
------f-e-d-e-f------
--------f-e-f--------
----------f----------

## Remove the second for loop!

In [14]:
subarray_[6-1-2:6]

'def'

In [15]:
(top_l+'-'+top_r).center(50)

'                f-e-d-c-b-c-d-e-f                 '

In [16]:
lst = [1,2,3,4,5]
lst.reverse()

In [17]:
lst

[5, 4, 3, 2, 1]

In [18]:
lst = [1,2,3,4,5]
lst = lst[::-1]
print(lst)

[5, 4, 3, 2, 1]

In [23]:
print_rangoli(15)

----------------------------o----------------------------
--------------------------o-n-o--------------------------
------------------------o-n-m-n-o------------------------
----------------------o-n-m-l-m-n-o----------------------
--------------------o-n-m-l-k-l-m-n-o--------------------
------------------o-n-m-l-k-j-k-l-m-n-o------------------
----------------o-n-m-l-k-j-i-j-k-l-m-n-o----------------
--------------o-n-m-l-k-j-i-h-i-j-k-l-m-n-o--------------
------------o-n-m-l-k-j-i-h-g-h-i-j-k-l-m-n-o------------
----------o-n-m-l-k-j-i-h-g-f-g-h-i-j-k-l-m-n-o----------
--------o-n-m-l-k-j-i-h-g-f-e-f-g-h-i-j-k-l-m-n-o--------
------o-n-m-l-k-j-i-h-g-f-e-d-e-f-g-h-i-j-k-l-m-n-o------
----o-n-m-l-k-j-i-h-g-f-e-d-c-d-e-f-g-h-i-j-k-l-m-n-o----
--o-n-m-l-k-j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j-k-l-m-n-o--
o-n-m-l-k-j-i-h-g-f-e-d-c-b-a-b-c-d-e-f-g-h-i-j-k-l-m-n-o
--o-n-m-l-k-j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j-k-l-m-n-o--
----o-n-m-l-k-j-i-h-g-f-e-d-c-d-e-f-g-h-i-j-k-l-m-n-o----
------o-n-m-l-k-j-i-h-g-f-e-d-e-f-g-h-i-j-k-l-m-n-o------
--------o-n-m-l-k-j-i-h-g-f-e-f-g-h-i-j-k-l-m-n-o--------
----------o-n-m-l-k-j-i-h-g-f-g-h-i-j-k-l-m-n-o----------
------------o-n-m-l-k-j-i-h-g-h-i-j-k-l-m-n-o------------
--------------o-n-m-l-k-j-i-h-i-j-k-l-m-n-o--------------
----------------o-n-m-l-k-j-i-j-k-l-m-n-o----------------
------------------o-n-m-l-k-j-k-l-m-n-o------------------
--------------------o-n-m-l-k-l-m-n-o--------------------
----------------------o-n-m-l-m-n-o----------------------
------------------------o-n-m-n-o------------------------
--------------------------o-n-o--------------------------
----------------------------o----------------------------